src/DataProcessors/ФиксацияОборотовЯчеекКанбанов/ФиксацияОборотовЯчеекКанбанов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФиксацияОборотовЯчеекКанбанов</name>
</mdclass:DataProcessor>

src/InformationRegisters/ОборотЯчеекКанбанов/ОборотЯчеекКанбанов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОборотЯчеекКанбанов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МестоФиксации</name>
    <type>
      <types>CatalogRef.МестаФиксации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/ФиксацияОборотовЯчеекКанбанов/Forms/Форма/Module.bsl
&НаСервере
Процедура ОчиститьФорму()
МестоХранения = Справочники.МестаХранения.ПустаяСсылка();
МПЗ = Неопределено;
НомерЯчейки = 0;
Количество = 0;
КонецПроцедуры

&НаСервере
Функция ПолучитьМестоХраненияКанбанов(Линейка)
Возврат(Линейка.МестоХраненияКанбанов);	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыКанбана(ПЗ)
Парам = Новый Структура("МестоХраненияПотребитель,Номенклатура,НомерЯчейки",ПЗ.ДокументОснование.МестоХраненияПотребитель,ПЗ.ДокументОснование.Номенклатура,ПЗ.ДокументОснование.НомерЯчейки);
Возврат(Парам);	
КонецФункции

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если ЭтаФорма.ВводДоступен() Тогда
	Массив = ОбщийМодульВызовСервера.РазложитьСтрокуВМассив(Данные,";");
		Если Массив[0] = "3" Тогда
		ЗначениеПараметра1 = ОбщийМодульВызовСервера.ПолучитьЗначениеИзСтрокиВнутр(Массив[1]);
			Если ЗначениеПараметра1 = Неопределено Тогда
			Сообщить("Линейка или место хранения не найдена!");
			ОчиститьФорму();
			Возврат;	
			КонецЕсли;
				Если ТипЗнч(ЗначениеПараметра1) = Тип("СправочникСсылка.Линейки") Тогда
				МестоХранения = ПолучитьМестоХраненияКанбанов(ЗначениеПараметра1);
				Иначе	
				МестоХранения = ЗначениеПараметра1;
				КонецЕсли; 
		МПЗ = ОбщийМодульВызовСервера.ПолучитьЗначениеИзСтрокиВнутр(Массив[3]);
			Если МПЗ = Неопределено Тогда
			Сообщить(Массив[3]+" - МПЗ не найдена!");
			ОчиститьФорму();
			Возврат;	
			КонецЕсли;
		Количество = Число(Массив[4]);
		НомерЯчейки = Число(Массив[5]);	
		//ИначеЕсли Массив[0] = "4" Тогда
		//ПЗ = ОбщийМодульВызовСервера.ПолучитьЗначениеИзСтрокиВнутр(Массив[1]);
		//Парам = ПолучитьПараметрыКанбана(ПЗ);
		//МестоХранения = Парам.МестоХраненияПотребитель; 
		//МПЗ = Парам.Номенклатура;
		//НомерЯчейки = Парам.НомерЯчейки;		
		Иначе
		Сообщить("Неверный формат QR-кода!");	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ОписаниеОшибки = "";
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
   Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
      ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
      ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , ОписаниеОшибки);
      Сообщить(ТекстСообщения);
   КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
КонецПроцедуры

&НаСервере
Процедура ЗафиксироватьВремяНаСервере()
ОЯК = РегистрыСведений.ОборотЯчеекКанбанов.СоздатьМенеджерЗаписи();
ОЯК.Период = ТекущаяДата();
ОЯК.МестоФиксации = МестоФиксации;
ОЯК.МестоХранения = МестоХранения;
	Если ТипЗнч(МПЗ) = Тип("СправочникСсылка.Материалы") Тогда
	ОЯК.Подразделение = Константы.МестоХраненияОсновное.Получить().Подразделение;
	Иначе	
	ОЯК.Подразделение = МПЗ.Канбан.Подразделение;
	КонецЕсли; 
ОЯК.МПЗ = МПЗ;
ОЯК.НомерЯчейки = НомерЯчейки;
ОЯК.Количество = Количество;
ОЯК.Записать();
МестоХранения = Справочники.МестаХранения.ПустаяСсылка();
МПЗ = Неопределено;
НомерЯчейки = 0;
Количество = 0;
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьВремя(Команда)
ЗафиксироватьВремяНаСервере();
КонецПроцедуры
